[
    {
        "id": "4765d728-a170-484a-813d-01d4193307c6",
        "title": "Verizon’s mobile services are down across the country",
        "body": "Verizon experienced a huge outage that affected its mobile services across the country and lasted for several hours. But as of Monday evening, the company says services have been restored.“Verizon engineers have fully restored today’s network disruption that impacted some customers,” the company said on its Verizon News account on X at 7:18PM ET. “Service has returned to normal levels.  If you are still having issues, we recommend restarting your device. We know how much people rely on Verizon and apologize for any inconvenience.  We appreciate your patience.” Throughout the outage, Verizon’s support account replied to people expressing complaints, with some users reporting that their phones were in SOS mode. According to that account, “the outage is affecting some customers’ Data, Voice, and Text services.”At one point during the outage, Downdetector observed three fifteen-minute periods with more than 100,000 user reports of problems, according to data shared with The Verge by spokesperson Michelle Badrian. That data also showed that Downdetector received more than 1.5 million total user reports between 8AM ET and 4PM ET.Downdetector’s outage map showed hotspots in many cities, and based on that map, it appeared as though the outages are more prevalent on the East Coast.“During the incident we received reports from Paducah, Birmingham, Fairhope, Foley, Mobile, Montgomery, Pelham, Phenix City, Trussville, Valley, Bella Vista, Benton, Bentonville, Brookland, Des Arc, Fayetteville, Heber Springs, Hot Springs Village, Rogers, Searcy and 1678 other cities,” according to another outage report website tracking the outage. Earlier in the day, the Federal Communications Commission posted that it was aware of the outage and was “working to determine the cause and extent of these service disruptions.”Updates, September 30th: Verizon says it has restored service after the outage. In earlier updates, we added Verizon and FCC statements, updated the quote about reports of which cities were affected, and noted that Downdetector shows more than 100,000 user reports.Comments",
        "link": "https://www.theverge.com/2024/9/30/24258362/verizon-mobile-services-down-sos-mode",
        "image_path": "static/article_images\\4765d728-a170-484a-813d-01d4193307c6.jpg"
    },
    {
        "id": "93b7735d-8a7c-4ebb-836c-0d45fad09a34",
        "title": "Reddit is making sitewide protests basically impossible",
        "body": "Reddit is giving its staff a lot more power over the communities on its platform. Starting today, Reddit moderators will not be able to change if their subreddit is public or private without first submitting a request to a Reddit admin. The policy applies to adjusting all community types, meaning moderators will have to request to make a switch from safe for work to not safe for work, too.By requiring admin approval for the changes, Reddit is taking away a lever many communities used to protest the company’s API pricing changes last year. By going private, the community becomes inaccessible to the public, making the platform less usable for the average visitor. And that’s part of the reason behind the change. “The ability to instantly change Community Type settings has been used to break the platform and violate our rules,” Reddit VP of community Laura Nestler, who goes by the username Go_JasonWaterfalls on the platform, writes in a post on r/modnews. “We have a responsibility to protect Reddit and ensure its long-term health, and we cannot allow actions that deliberately cause harm.”Last year, thousands of subreddits went private to protest changes to Reddit’s API pricing that forced some apps and communities to shut down. Going private was effective during the protests in making a statement and raising awareness. But it also blocked off content that Reddit users might have made with the expectation that it would stay public. (Going private made Google searches worse, too.)During the protests, Reddit sent messages to moderators of protesting communities to tell them that it would remove them from their posts unless they reopened their subreddits. It also publicly noted that going NSFW (Not Safe For Work), a tool moderators used to add friction to accessing a subreddit and to make the subreddit ineligible for advertising, was “not acceptable.”RelatedHow Reddit crushed the biggest protest in its historyMore than a year after the protests, Reddit is essentially back to normal. But it appears the company still feels it has to make changes to protect the platform.“While we are making this change to ensure users’ expectations regarding a community’s access do not suddenly change, protest is allowed on Reddit,” writes Nestler. “We want to hear from you when you think Reddit is making decisions that are not in your communities’ best interests. But if a protest crosses the line into harming redditors and Reddit, we’ll step in.”Reddit says it will review requests to make communities private or NSFW within 24 hours. For smaller or newer communities — under 5,000 members or less than 30 days old — requests will be approved automatically. And if a community wants to temporarily restrict posts or comments for up to seven days, which might be useful for a sudden influx of traffic or when mod teams want to take a break, they can do so without approval with the “temporary events” feature.A GIF showing how to make a Community Type request on Reddit. GIF: RedditReddit worked with mods ahead of announcing this change, Nestler tells me in an interview. The same day Nestler and I talked, for example, she said that she had spoken about the changes with Reddit’s mod council, which has about 160 moderators.She characterized their reaction as “broadly measured” and said that the mods understand Reddit’s rules and why Reddit is making the change, “even if they don’t necessarily like it.” But “the feedback that was very obvious was this will be interpreted as a punitive change,” particularly in response to last year’s API protests, she says.I asked if Reddit would reconsider this new requirement if there was significant blowback. “We’re going to move forward with it,” Nestler says. “We believe that it’s needed to keep communities accessible. That’s why we’re doing this.” Nestler says the change is something that the company has talked about since she came to Reddit (she joined in March 2021, two years before the protests). But the protests made it clear that letting moderators make their communities private at their discretion “could be used to harm Reddit at scale” and that work on this feature was “accelerated” because of the protests.Nestler wanted to make clear that its rules aren’t new and that the enforcement of the rules isn’t new. “Our responsibility is to protect Reddit and to ensure its long-term health,” Nestler says. “After that experience, we decided to deprecate a way to cause harm at scale.” However, she says that the company only did so “when we were confident that we could bring our mods along with us.”Comments",
        "link": "https://www.theverge.com/2024/9/30/24253727/reddit-communities-subreddits-request-protests",
        "image_path": "static/article_images\\93b7735d-8a7c-4ebb-836c-0d45fad09a34.jpg"
    },
    {
        "id": "5d5baac6-4506-48e9-8111-02ce82382dd7",
        "title": "Epic is suing Google — again — and now Samsung, too",
        "body": "Four years after Epic sued Google for running an illegal app store monopoly — a case it won this past December — Epic is suing again. The Fortnite game developer has filed a second antitrust lawsuit against Google, and now additionally Samsung, accusing them of illegally conspiring to undermine third-party app stores.The lawsuit revolves around Samsung’s “Auto Blocker” feature, which now comes turned-on-by-default on new Samsung phones. While it’s turned on, it automatically keeps users from installing apps unless they come from “authorized sources” — namely, Google and Samsung’s app stores. Epic claims there’s no process for any rival store to become “authorized.”RelatedEpic win: Jury decides Google has illegal monopoly in app store fightEpic CEO Tim Sweeney: the post-trial interviewA fortnight in Fortnite courtWhen Epic filed its original lawsuits against Google and Apple in August 2020, it didn’t yet have its own mobile app store. Now, it does: On August 16th, it launched the Epic Games Store on Android globally and on iPhones in the European Union where the EU Digital Markets Act forced Apple to allow alternate stores.But a month before it could launch its own store, Epic alleges, Samsung suddenly decided to make Auto Blocker more or less on-by-default — making it harder for new phone buyers to install competing apps themselves. Sure enough, I can’t install the Epic Games Store with Auto Blocker on. It works fine with it off. Photo by Sean Hollister / The VergeEpic claims it now requires “an exceptionally onerous 21-step process” to download a third-party app store onto a Samsung phone, making it that much more likely users will give up somewhere along the way. While “21 steps” seems like an exaggeration to me (Epic’s own website claims turning off Auto Blocker takes just four!) I can see the company’s point when I try it on my own Samsung phone. Not only does Auto Blocker prevent me from installing the new Epic Games Store, the “can’t install app” pop-up no longer tells me how to turn Auto Blocker off. When I search for “turn off auto blocker” in my Samsung phone’s universal search bar, there are no relevant search results; when I search for “auto blocker,” I have to tap through several additional screens to shut it off. One of them asks me if I’m really sure, claiming “Auto Blocker keeps your phone safe by blocking threats and other suspicious activity.”Today, Epic alleges that promise of safety is entirely bogus: “Auto Blocker conducts no assessment of the safety or security of any specific source or any specific app before blocking an installation,” the legal complaint reads. “The thing’s not designed to protect against malware, which would be a completely legitimate purpose,” says Epic CEO Tim Sweeney. “The thing’s designed to prevent competition.” “The thing’s not designed to protect against malware.”In a roundtable interview with journalists, though, Sweeney admits he doesn’t yet have proof that Google and Samsung colluded — he’s hoping that comes out in the legal discovery process, like so very many embarrassing things did in Epic v. Google. He also admits he didn’t actually ask Samsung if the company would freely make the Epic Games Store an “authorized source.”Like with Sweeney’s previous lawsuits, he claims that’s because he’s fighting on behalf of all app developers, not just Epic. “If we’d fought Epic v. Apple and Epic v. Google solely on the basis of Epic getting special privileges, perhaps settlement discussions with Apple and Google might have been fruitful,” says Sweeney. “But if we did that, we’d be selling out all developers.” Instead, he says, he privately asked Samsung to either change Auto Blocker so it’s turned off by default, or to create “an honest whitelisting process” that would automatically let honest apps through Samsung’s new barrier. When Samsung and Epic couldn’t agree on “the basis” of that whitelisting process, he says Epic threatened legal action, even sharing a draft version of today’s legal complaint with Samsung. \nSamsung would not confirm or deny to The Verge whether Auto Blocker actually scans an app for threats or suspicious activity. It would not confirm or deny whether it worked with Google on the feature. Samsung points out that it doesn’t secretly or quietly turn on Auto Blocker, though; it lets users choose. “The default setting for Auto Blocker is set to On in the phone’s initial setup wizard, but you can also change this setting to Off during the initial setup,” the company’s support page notes. Here’s Samsung’s full statement, provided by spokesperson Chris Langlois:Contrary to Epic Game’s assertions, Samsung actively fosters market competition, enhances consumer choice, and conducts its operations fairly. The features integrated into our devices are designed in accordance with Samsung’s core principles of security, privacy, and user control, and we remain fully committed to safeguarding users’ personal data. Users have the choice to disable Auto Blocker at any time. We plan to vigorously contest Epic Game’s baseless claims.Google would also not confirm or deny whether it worked with Samsung on the feature. “This is a meritless lawsuit. Android device makers are free to take their own steps to keep their users safe and secure,” reads a statement via Google spokesperson Dan Jackson.It’s not yet clear whether Epic has been harmed by Auto Blocker. Only two new Samsung phones have shipped since Samsung turned it on-by-default. While Sweeney claims Google’s previous attempts to add friction to third-party apps (“Unknown Sources”) caused half the people who clicked “download” to give up partway, he admits he doesn’t yet have data showing that the Samsung feature is making things worse. He says the Epic Games Store has now reached 10 million mobile installs, against a “totally achievable” 100 million target by the end of the year. He characterizes that as “traction but not an enormous amount.”In Epic v. Google, the company argued that the Unknown Sources install flow made it so hard to attract new users to a rival app store, Sweeney was eventually forced to bring Fortnite to Google’s store even though he promised Samsung he wouldn’t. Though the jury wasn’t asked to decide on “Unknown Sources” specifically, they did decide that Epic was harmed by Google’s behavior overall.Epic is asking for a jury trial this time as well. RelatedEpic judge says he’ll ‘tear the barriers down’ on Google’s app store monopolyHere’s 16 pages of what Epic wants after winning its Google app store lawsuitSpeaking of Epic v. Google, we’re expecting Judge James Donato to issue his final order there any day now, and it’s easy to imagine a world where Epic v. Samsung gets affected by how he decides to change Google’s behavior. If he grants Epic’s biggest asks, the Google Play Store would be forced to carry the Epic Games Store and other app stores inside of it and third-party app stores like Epic’s would also get access to Google Play’s entire app catalog. In that world, Auto Blocker seems a little less relevant. But a Google appeal is guaranteed, and Epic is positioning today’s new lawsuit as a way to prevent and dissuade Google and partners from pursuing a “malicious compliance strategy” in the meanwhile. You could even argue that’s what Judge Donato asked for: in Epic v. Google, he repeatedly told Epic’s lawyers that he wouldn’t grant their request for an anti-circumvention provision to keep Google from getting creative with workarounds. “We don’t do don’t-break-the-law injunctions... if you have a problem, you can come back,” he said last November. Sweeney wouldn’t necessarily commit to suing other companies that erect barriers to third-party app stores, but says Epic is “watching that very closely.” “Fortunately nobody has done this but Samsung, and we hope to keep it that way.”Update, September 30th: Added that Samsung and Google would not confirm or deny whether they worked together on Auto Blocker (or whether Auto Blocker scans for threats), and added statements for both. Comments",
        "link": "https://www.theverge.com/policy/2024/9/30/24256395/epic-sues-google-samsung-antitrust-auto-blocker",
        "image_path": "static/article_images\\5d5baac6-4506-48e9-8111-02ce82382dd7.jpg"
    },
    {
        "id": "1ada404a-186b-40cf-b02c-3132ae19f9eb",
        "title": "Leaked Google Pixel 9A renders reveal a visor-free look",
        "body": "Google’s first leak of the fall is here, with new renders of its upcoming Pixel 9A posted online for the world to see. As with the Pixel 8A leak earlier this year, Android Headlines has yet again acquired images of Google’s next budget A-series release, this time by way of OnLeaks, which was responsible for spoiling the recent Pixel 9 lineup.The big change coming on the Pixel 9A, according to the leak, is that it won’t feature Google’s now-signature visor look for its camera housing. Instead, it seems like there are two cameras in a pill-shaped module that sits almost flush with the rear of the phone. A camera flash is set to the right, making it look like the rear of an iPhone 7 Plus but magnified. The rest of the body looks similar to other Pixel 9 devices — and current iPhones — with thin-looking bezels around the screen.Android Headlines notes the 9A might ship with Android 15, and it could be the last Google device to include a Samsung-based Tensor chip, with Google moving on to using TSMC for future processors in 2025. Google usually releases its A-series phones in the springtime, typically during Google I/O, so it might be a while before we get all the details.Comments",
        "link": "https://www.theverge.com/2024/9/30/24258413/google-pixel-9a-render-image-leak-rumor",
        "image_path": "static/article_images\\1ada404a-186b-40cf-b02c-3132ae19f9eb.jpg"
    },
    {
        "id": "33c51ec1-bcc7-44b2-8d5a-7f159a1afb7f",
        "title": "Marvel and DC lose ‘Super Hero’ trademarks",
        "body": "You know how Marvel and DC have held joint ownership over trademarks for “Super Hero” for decades? That time is apparently mostly over, as the US Patent and Trademark Office has canceled the companies’ claim to several of their trademarks, reports Reuters.The cancellation comes as the result of a challenge from Superbabies Limited, a small company that produces a series of Superbabies comics about, well, superhero babies. Superbabies creator S.J. Richold decided to challenge the two comic giants’ claim to the trademarks after DC “attempted to block Richold’s efforts to promote The Super Babies,” wrote the law firm that represented Richold in a release.RelatedDisney sues to keep its Avengers copyrights assembled‘Spinning’ is trademarked, and Peloton isn’t happy about itA demure and mindful trademark investigationMarvel and DC didn’t respond to the challenge by a July 24th, 2024 due date, resulting in the marks’ cancellation, according to the USPTO’s decision. As such, the office canceled four trademarks, the oldest of which USPTO records show was for the trademark “SUPER HERO,” registered in 1967. The two companies still co-own a “SUPER HEROES” trademark, registered in 2018, as well as a “SUPER-VILLAIN” trademark that they secured in 1985. If you want to dive down a rabbit hole on the subject of Marvel and DC’s super hero-related trademarks, I’ve got just the thing. One of the lawyers involved in the Superbabies trademark challenge, Adam Adler, actually wrote up a two-part series of articles for Escapist Magazine lightly explaining how the companies came to jointly own the trademarks and what they’ve done to guard that ownership over the years. Adler links out to other articles with even deeper dives, too. Correction September 30th: In a previous version of this story, “patents” was used in one instance, instead of “trademarks.” It has been corrected.Comments",
        "link": "https://www.theverge.com/2024/9/29/24257677/marvel-dc-super-hero-trademark-canceled-challenge-superbabies",
        "image_path": "static/article_images\\33c51ec1-bcc7-44b2-8d5a-7f159a1afb7f.jpg"
    },
    {
        "id": "feb9c085-aa60-470a-859d-046a17e743c4",
        "title": "Ford targets EV ‘fence-sitters’ with offer of free home charger and installation",
        "body": "For customers still unsure whether they’re ready to make the switch to an all-electric vehicle, Ford is sweetening the pot. Today, the company launched a new initiative called the “Ford Power Promise,” in which it will provide a suite of benefits to customers who buy or lease a new EV. And chief among them is a complimentary home charger for all new customers, as well as the costs of standard installation. The charger that’s being offered is the company’s Ford Charge Station Pro, a $1,310 Level 2 charger that comes with a standard CCS1 connector. Ford declined to put a monetary value on the installation but said it would cover costs up to 60 amps of power and 80 feet of wire run. Customers who need to upgrade their home electrical panel before the installation, however, will need to cover those costs themselves. Ford’s free charger and installation offer starts October 1st and extends through the end of the year. It will only be available to customers who buy or lease a new EV during that time period. For customers who buy or lease a new EV but already have a home charger installed, Ford will provide them with the cash equivalent of $2,000. “We’re the only ones doing this,” said Becca Anderson, senior director of customer experience at Ford’s Model e division. “This means less stress and more convenience for our customers, making their home charging set-up up easy.”“We’re the only ones doing this”Like most automakers, Ford is struggling to get more customers to consider switching to electric. Even though the company is the number two seller of EVs in the US, behind Tesla, and its EV sales continue to grow, the company is still confronting a lot of headwinds in the form of myths and misconceptions about EV ownership. “We have a lot of customers open to electric,” said Martin Delonis, senior manager of strategy at Ford Model e, “but they’re sitting on the fence.”According to market research conducted by Ford and Boston Consulting Group, these so-called “fence-sitters” say they are worried about things like EV range, battery health, and the overall cost of ownership. But they’re also motivated by “quality and convenience,” which aligns then more closely with gas and hybrid shoppers as opposed to early adopters. “We’ve done the research and found that it’s not range anxiety we’re dealing with,” Delonis added. “It’s change anxiety.”Most customers overestimate how much range they’ll need in a vehicle, just as they often fail to see the benefits of charging a vehicle at home. They assume they’ll need to use public chargers more often than they do. And they falsely believe that the battery will wear out before the vehicle’s end-of-life. “Change anxiety”To help ease their concerns, Ford is upping the ante with new benefits, like a free home charger, and some old ones that customers may not be aware of. Ford said it will now offer 24/7 call and text support for all EV owners who may have questions or concerns about their new purchase. The company is also highlighting a preexisting eight-year, 100,000-mile warranty for the battery of the vehicle. And to address unease around charging, Ford is emphasizing its Blue Oval Charging Network, which includes a number of third-party charging providers, as well as the Tesla Supercharger network. Ford has been racing to get Tesla adapters to its EV customers so they can access Superchargers across the country. Ford is “ramping up production” of the adapters after some initial delays over the summer, Delonis said. While Ford has seen its EV sales grow quarter over quarter, the company is still struggling to rein in costs. The company reported a $1.3 billion loss for its Model e EV division in the first quarter of 2024 and a $1.1 billion loss in the second quarter. It also canceled a planned three-row electric SUV and delayed a new electric truck until 2027. Comments",
        "link": "https://www.theverge.com/2024/9/30/24256072/ford-ev-home-charger-free-installation",
        "image_path": "static/article_images\\feb9c085-aa60-470a-859d-046a17e743c4.jpg"
    },
    {
        "id": "22dfb972-c9ef-49b4-b879-8182f184f154",
        "title": "We tested six smart rings, and there’s a clear winner",
        "body": "Smart rings are having a moment. After years as a niche gadget, regular people are starting to see the appeal. They’re thinner, more accurate, and more wearable compared to a decade ago — and for some people, they’re a smarter choice than smartwatches.Smartwatches may dominate the wearable landscape, but they don’t work for everyone. They can be bulky. Daily charging is a pain. Plus, they don’t always work for people with wrist tattoos or those who participate in more niche sports. (Ever try stuffing a Garmin under a boxing glove? It’s not fun.) Conversely, smart rings are discreet and often have multiday battery life, and your finger can be a more accurate place to gather heart rate data. From left to right, we have the Circular Slim, RingConn, Ultrahuman Ring Air, Galaxy Ring, Oura Ring, and Evie Ring.So which smart ring is the best? To find out, I called in six smart rings currently on the market: the Oura Ring, Ultrahuman Ring Air, Circular Slim, Samsung Galaxy Ring, RingConn, and Evie Ring. But side note: this isn’t a traditional review or buying guide. This is a gauntlet where smart rings get eliminated based on my personal experience and preferences, until there’s just one winner left.With that in mind, for the past few months, I slept with these rings. Showered with them. Exercised with them. Compared a crapton of health data until my eyes bled. For a while, I wore all six simultaneously like a mafia don wearing two pairs of smart ring brass knuckles. I now have six ring tans. All so I could definitively tell you which is the one smart ring to rule them all.The Circular Slim was my least favorite of the bunch.  Photo by Amelia Holowaty Krales / The VergeAccuracy is a mustFolks, it ain’t the Circular Slim.On paper, the $294 Circular Slim has a lot of promise. It executes on almost none of it. The big problem was accuracy. While the metrics were generally fine, my step count was occasionally so wrong I couldn’t help but laugh. I’m talking 5,000 steps off compared to my other wearables. And that’s when I had the patience to review my metrics because syncing is an absolute chore. On average, it took two to three minutes, which meant I frequently rage quit the app. It’d be one thing if this was a one-off. It was not. Most people want smart rings for health tracking. If you’re not accurate and syncing is a chore, what is the point? It’s a bummer because this is the only smart ring with ambitions of being anything other than a fitness tracker. It has a vibration motor for silent alarms. When Circular was still a Kickstarter, that motor was also supposed to alert you to notifications. That feature has been “coming soon” for years — something users are none too happy about. At the moment, the haptics are limited to silent alarms, but even that doesn’t quite hit the mark. You have to tap the ring twice above the logo to dismiss the alarm. In the dark, that logo is nigh impossible to see. Most mornings, I’m so groggy I end up smacking my hand multiple times just to turn it off. There’s also an ambitious AI chatbot that spits out daily recommendations. The problem is it takes 14 days to calibrate, and like other AI-powered fitness features, it wasn’t very helpful. But the real kicker is the charger is an easily misplaced USB stick. It’d be one thing if it had great battery life, but no. I got two to three days with all the features turned on. I also don’t think a nearly $300 ring should feel like it was made of cheap, 3D-printed plastic. Easily my least favorite ring of the bunch.Eliminated: Circular RingThe open-gap design remains my favorite thing about the Evie Ring.Design matters, but so does polishThe next ring on the chopping block is the $269 Evie Ring. It hurts me to write this because it’s the prettiest and most comfortable of the six. Most smart rings tend to be indistinguishable from one another, but the Evie Ring has a clever open-gap design, which means it doesn’t matter if your fingers bloat or gain a few pounds. You’ll always be able to take it off with ease. RelatedThe Evie Ring is cleverly designed but has some first-gen quirksIf design and comfort were the only factors, this ring would win. But it’s not. The Evie Ring’s main issue is it’s the quintessential first-gen product with first-gen issues. Everything works decently, unlike the Circular Ring, but there’s a distinct lack of polish. Syncing and firmware updates can take a while, and Movano hasn’t figured out the best way to present and contextualize your data — though it makes a valiant effort. The ring has just relaunched to address some of this feedback, but it’s still very much playing catch-up. Hopefully, future versions will smooth out the kinks.  Eliminated: Evie RingThe RingConn’s square shape wasn’t my favorite, but I’m a fan of charging cases over docks.Being ‘fine’ isn’t enoughThe $279 RingConn isn’t bad. It simply doesn’t stand out. It has the best battery life of the pack. I reliably got six to nine days on a single charge and it has a neat little charging case. It’s just so… middling. This is the smart ring I’d recommend people get if all they wanted was basic, mostly decent health tracking without any bells and whistles. Syncing can sometimes take a bit, but nowhere near as long as the Circular Slim or Evie Ring. Honestly, the thing that bugged me most about the RingConn was its slightly squarish shape. It can feel a bit odd on the finger, but unless you’re hypersensitive to that kind of thing, you’ll barely notice it after a few days. The RingConn’s flaws don’t do it a discredit. But this is a battle royale. You can’t win by just being fine if other options are good, nay great.Eliminated: RingConnThe hardware is great. It’s just not going to be the best without a Galaxy Watch. Photo by Victoria Song / The VergeIt’s got to stand aloneFor what it’s worth, the $400 Samsung Galaxy Ring nails the hardware. This is the slimmest ring of the bunch and the most comfortable after the Evie Ring, and the futuristic charging case adds to its chic allure. The reason why it doesn’t take the title is because this ring is essentially for Samsung diehards — to the detriment of everyone else. RelatedThe Galaxy Ring keeps you in Samsung’s orbitCase in point, you get the best battery life if you use it with a Samsung Galaxy Watch. The cool double pinch gesture to control the camera or dismiss notifications? Yeah, you need a new Z Flip 6 or Z Fold 6. (It’s purportedly making its way to the S24 but is unavailable as of this writing.) It’s essentially a neat accessory for your Galaxy Watch.Eliminated: Galaxy RingThe Ultrahuman Ring Air came so close, but it’s best geared to the Whoop crowd.Training shouldn’t be the only focusThe $349 Ultrahuman Ring Air came so close to taking it all. It’s slim and lightweight, and I got compliments while wearing it. Battery life isn’t the best, but it’s decent for the category at three to four days. Where it shines is fitness tracking and training — meaning it caters to athletes above everyone else. Compared to the Oura Ring, which has a streamlined focus on general wellness, this ring zeroes in on optimization. Say you’re trying to build healthier sleep habits. The companion app will give you a list of drinks with their average caffeine content and flag when you should drink what if your goal is to sleep by a certain time. I’m trying to wake up earlier so I can sneak in runs before the sun starts baking the planet. When I wake up, the ring shows me a “Phase Advance” timer. If I exercise during that time, it’s more likely to shift my natural Circadian rhythm earlier. There are a bunch of “upgrade” widgets called Power Plugs that let you further customize your experience by focusing on other goals, like sun exposure for vitamin D, cycle tracking, Circadian alignment, etc. Some Power Plugs are free. Others, like the forthcoming AFib detection, will cost an extra $4.90 monthly, which I don’t love. Accuracy is otherwise on par with my other devices, but the way my data is interpreted gives me a little pause. For example, I’m flattered this ring thinks my VO2 Max — a metric used to gauge your aerobic fitness — is 44 ml/kg/min (apparently, that’s superior) and that my resting heart rate is Elite. Based on my years of testing other devices, this is overly generous. Granted, every company uses a different algorithm, but I generally fall in the slightly above average — emphasis on slightly — range. While I like the Ultrahuman Ring Air a lot, it’s partly because I’m that dork who likes training. All this is a bit much if you’re a more general user. Eliminated: Ultrahuman Ring Air I gave five rings the chance to dethrone the Oura Ring. It hasn’t happened yet. Image: Victoria Song / The VergeExperience is king Most of the smart rings I tested did one or two things better than the $299 Oura Ring. But as a whole, Oura’s experience in this space keeps it on top of the competition. If you care about accuracy and health tracking, Oura does a lot of work validating its algorithm, working with researchers, and putting out a metric ton of documentation about its features. It’s been putting in the work for several years, and it shows in the final product. The app is polished, syncing and updates are never an issue, and it’s widely available. The best thing about all this new competition is it’s also lit a fire under Oura’s butt to release more features and updates in the past few months than it has in a while. The main gripes I have are the $6 monthly subscription, and its charging dock isn’t my favorite. (Please, please, please let the next version have a charging case.)RelatedOura Ring Generation 3 review: a relationship for the long termSmart rings as a whole won’t be dethroning smartwatches anytime soon. They’re too expensive when a smartwatch can do much more for the same price. But, if you’re going to buy a smart ring, you should get the best one — and that’s the Oura Ring. I gave five other rings every opportunity to dethrone it. Perhaps it’ll happen one day. But until then, the Oura Ring is king.Winner: Oura RingUpdated October 1st: Added more context on review criteria.",
        "link": "https://www.theverge.com/2024/10/1/24259284/oura-ring-samsung-galaxy-ring-ultrahuman-ring-air-ringconn-circular-ring-evie-ring-review-wearables",
        "image_path": null
    },
    {
        "id": "f43bab3f-184a-4be6-b17a-2da830782ccb",
        "title": "College students used Meta’s smart glasses to dox people in real time",
        "body": "Two Harvard students have created an eerie demo of how smart glasses can use facial recognition tech to instantly dox people’s identities, phone numbers, and addresses. The most unsettling part is the demo uses current, widely available technology like the Ray-Ban Meta smart glasses and public databases.AnhPhu Nguyen, one of the two students, posted a video showcasing the tech in action that was then picked up by 404 Media. Dubbed I-XRAY, the tech works by using the Meta smart glasses’ ability to livestream video to Instagram. A computer program then monitors that stream and uses AI to identify faces. Those photos are then fed into public databases to find names, addresses, phone numbers, and even relatives. That information is then fed back through a phone app.In the demo, you can see Nguyen and Caine Ardayfio, the other student behind the project, use the glasses to identify several classmates, their addresses, and names of relatives in real time. Perhaps more chilling, Nguyen and Ardayfio are also shown chatting up complete strangers on public transit, pretending as if they know them based on information gleaned from the tech.RelatedClearview AI and the end of privacy, with author Kashmir Hill Facial recognition tech has been frighteningly accurate for a while now, and I-XRAY is largely just chaining together a bunch of existing technologies. It relies in part on PimEyes, which The New York Times described in 2022 as an “alarmingly accurate” face search engine that “anyone can use.” Concerns around this tech have been heightened since it came out that Clearview AI was using facial recognition to help law enforcement. What’s new about Nguyen and Ardayfio’s demo is how the tech is being paired with a consumer gadget that is discreet and easy to access.“The purpose of building this tool is not for misuse, and we are not releasing it,” Nguyen and Ardafiyo write in a document explaining the project. Instead, the students say their goal is to raise awareness that all this isn’t some dystopian future — it’s all possible now with existing technology. In particular, they point out that I-XRAY is unique because large language models (LLMs) enable it to work automatically, drawing relationships between names and photos from vast data sources.As you can see from this photo, the privacy light can be very hard to see in outdoor lighting. Even at night. Photo by Amelia Holowaty Krales / The VergePrivacy has always been a major concern with smart glasses. Google Glass originally failed due in part to public backlash at being recorded without consent in public spaces. However, it’s also true that in the decade since, people have become more accustomed to being filmed due to the rise of smartphones, vloggers, and TikTok. What’s unsettling about modern smart glasses, however, is that they don’t stand out quite as much as Google Glass did. The Ray-Ban Meta glasses used in this demo look just like any other pair of Ray-Bans. While that’s critical for smart glasses adoption, it also makes it harder for people to clock when someone might be wearing a camera on their face. The Meta glasses do include a privacy light that automatically turns on whenever you’re recording video. However, in our testing, we found that the light is hard to notice when you’re outside in bright lighting and that people often don’t notice when you’re filming — especially in crowded, public spaces.RelatedHow to make your offline self harder to find online How to delete the data Google has on you For its part, Meta cautions users against being glassholes in its privacy policy for the Ray-Bans. It urges users to “respect people’s preferences” and to clearly gesture or use voice controls when capturing video, livestreaming, or taking photos. However, the reality is people may also choose not to follow wearable etiquette, regardless of what Meta says. The Verge reached out for comment. Meta spokesperson Dave Arnold responded to our email by block quoting its terms of service, which reiterate the same guidance.This is a sobering reminder of how smart glasses can be abused, but there are some steps people can take to protect themselves. In their document, Nguyen and Ardafiyo list reverse face search and people search databases that allow you to opt out. Even so, keep in mind it’s nigh impossible to fully delete your online presence — you can only make your information less available. Update, October 2nd: Added response from Meta.Comments",
        "link": "https://www.theverge.com/2024/10/2/24260262/ray-ban-meta-smart-glasses-doxxing-privacy",
        "image_path": "static/article_images\\f43bab3f-184a-4be6-b17a-2da830782ccb.jpg"
    },
    {
        "id": "2b04702e-ded0-4229-b60b-d0c81494b5d4",
        "title": "Sonos has a plan to earn back your trust, and here it is",
        "body": "Sonos remains in the throes of the biggest controversy in its history — and it’s one of the company’s own making. Now, several months after the May release of its overhauled app badly tarnished the brand’s reputation, CEO Patrick Spence has announced a multipart plan to right the ship. You can break the strategy down into two main objectives. First, Sonos has taken steps to thoroughly understand just how the hell everything went so wrong — both with its software development practices and its underlying corporate culture — that it somehow wound up in this predicament to begin with. And second, the company is kicking off a broad effort intended to rebuild the trust of its customers and convince them that nothing like this will ever happen again. For once, there are actual stakes involved, albeit minor ones. Sonos says its executive leadership team will not accept their annual bonus payouts “unless the company succeeds in improving the quality of the app experience and rebuilding customer trust.” That’ll inevitably prompt an eye roll from some people; these executives still earn high pay and heaps of Sonos stock. But I guess it’s some motivation to keep pushing in the right direction.Sonos is extending its hardware warranty by an additional year for recent purchases. Photo by Chris Welch / The VergeIf you’ve purchased a Sonos speaker within the last year, here’s an important thing to know: the company is extending its manufacturer warranty by an additional year for select products that are still under warranty right now. This won’t bring older devices back under coverage, but it’ll provide a little extra peace of mind as Sonos works through this rough patch. (Note that the extension only applies to “home theater and plug-in speaker products,” meaning the Sonos Move, Move 2, Roam, and Roam 2 are excluded.)Now, let’s get back to the rest of this plan. Some of what Sonos is promising today is rather... vague. For example, take this whole bullet point from the company’s press release, which doesn’t really mean much of anything:Unwavering focus on the customer experience: To ensure that we deliver the highest level of customer experience, we will always establish ambitious quality benchmarks at the outset of product development and will not launch products before meeting these criteria. We will also enhance the tools necessary to measure the quality of the experience actually being delivered to customers to ensure that we maintain the standards our customers expect.Maybe that has significance internally at the company, but it reads like pure PR speak from the outside. Thankfully, Sonos is more specific elsewhere, vowing to implement a more stringent testing phase and beta program for all products — both hardware and software — that “will include more types of customers and more diverse setups for a longer testing period. This will allow us to find, diagnose and solve customer concerns more quickly before going to market.” Spence has admitted on multiple occasions that with the new app, Sonos moved too fast and failed to recognize the full gravity of bugs, missing features, and reduced functionality that led to an overwhelmingly negative reception upon its debut in May. Fundamentals like queue management, local library support, alarms, and even some accessibility options were either absent or broken. Sonos says major changes to its app will now be released gradually and that customers can opt in to test new features. Image: SonosSonos gave its latest progress report today, saying, “more than 80 percent of the app’s missing features have been reintroduced and the company expects to have almost 100 percent restored in the coming weeks. The reliability and speed of the app has improved with each release.” App updates will continue at a frequent cadence \"even after the current issues are fully resolved.\"With hindsight, Spence has acknowledged that Sonos should have introduced the new software as a beta, leaving the former “S2” app in place while bringing the two to parity over time. But that’s not what happened, which brings us to the next pledge:Demonstrate humility when introducing changes: In contrast to the all-at-once automated app release we issued in May, any major change to the Sonos app will be released gradually, allowing customers to adjust and provide feedback before it becomes the default. For new features smaller in scope, we will introduce an opt-in experimental features option in the app for customers who would like to participate in testing them.For everyone whose trust in the company has been shaken, that’s the most important change outlined in today’s press release. It’s at least evidence that Sonos has learned a critical lesson and won’t ever put customers through this kind of whiplash again.Do you know more about what’s happening at Sonos? I’ve revealed many of the company’s products before their official announcement. None of my sources have ever been caught or disciplined.The Sonos Arc Ultra and Sub 4 are nearing release, and it’s rumored that the company is far along in developing its own streaming video player. But beyond gadgets, I’d love to learn more about the mood and morale within Sonos as employees process the events (and missteps) of the last several months.You can reach me securely and confidentially via Signal at chriswelch.01 or 845-445-8455. I’m also available through Instagram or X DMs.Sonos is also taking steps to level up transparency both inside the company and beyond. After reports of prelaunch meetings that involved screaming and yelling over the new app’s dire state, the company is creating a “quality ombudsperson” role that “will ensure our employees have a clear path to escalate any concerns in terms of quality and customer experience.” The ombudsperson “will be consulted by executive leadership throughout the development process and before any product launches” and will publish a report twice each year, also making routine presentations to the Sonos board. The Sonos Ace headphones have been completely overshadowed by the app situation. Photo by Chris Welch / The VergeI’ve heard from multiple sources at the company who insist that concerns were raised and alarms were sounded throughout the app’s development, but Sonos leadership forged ahead with the release anyway. “They weren’t just told; they were warned,” one employee told me. Appointing an ombudsperson is clearly an attempt to prevent that exact scenario from playing out again in the future. Inside Sonos, morale has taken a serious hit, and there’s been plenty of finger-pointing in the wake of such a colossal unforced error, with some employees questioning the judgment of chief product officer Maxime Bouvat-Merlin. But in an email, Sonos chief strategy officer Eddie Lazarus told me that no changes to the product division are anticipated. “As a leadership team, we made the decision together to launch the app,” he said. Sonos customers will at least soon be given a louder voice at the table: the company says it will assemble a customer advisory board that will “provide feedback and insights from a customer perspective to help shape and improve our software and products before they are launched.” The details of what that advisory board will look like are still being finalized, Lazarus said.Sonos CEO Patrick Spence and other leadership executives will not receive an annual bonus if they fail to meet “objective measures in restoring consumer trust in Sonos,” according to Lazarus. Image: SonosSo that’s the general rundown on where Sonos is headed over the next several months. As it looks to get back on track, I can report that the company will resume its planned hardware releases in the coming weeks, beginning with the Sonos Arc Ultra and Sub 4. The Arc Ultra will be the first product to contain “breakthrough” transducer technology developed by Mayht, a startup that Sonos acquired in 2022. The soundbar, codenamed Lasso, will deliver significantly richer sound and pack more of a bass punch than the original Arc. Still, this app debacle is certain to have repercussions that extend well into the future. Sonos has managed to self-sabotage the impact of its first-ever headphones, the Sonos Ace. The Ace quickly fell by the wayside thanks to this ordeal and have yet to regain much momentum. Improvements keep coming, but early sales of the headphones have reportedly been dismal.More importantly, questionable decisions by the company’s leadership have had severe consequences for dedicated, hard-working employees: in August, Sonos laid off 100 people. The cuts included roles in software quality, platforms / infrastructure, marketing, and other departments. Among those laid off were two employees who tried their best to address what was then a growing outcry over the new Sonos app with a community Q&A back in mid-May.",
        "link": "https://www.theverge.com/24258431/sonos-app-controversy-patrick-spence-plan",
        "image_path": null
    },
    {
        "id": "2a0d0204-9d47-4fe5-b38b-0b6c66ca964b",
        "title": "These boxes will send Dolby Atmos through your home’s power lines",
        "body": "Fasetto has announced that its Audio Cu system, which connects TVs and other audio devices to speakers and subwoofers using the existing power line wiring in a home, has received Dolby Atmos Product Certification from Dolby Laboratories.Similar to powerline networking solutions that can leverage existing electrical wiring to share internet around a home, Fasetto’s Audio Cu is an alternative to having to snake audio cables through a wall or attempt to camouflage wires connecting speakers to an audio source under rugs and furniture. It’s also an alternative to wireless solutions like Wi-Fi or Bluetooth, which have their own challenges and compromises, including added latency, audio compression, and signal reliability.You’ll need an Audio Cu receiver attached to every speaker in your setup and a power outlet for each of them. Image: FasettoFor a home theater setup with five speakers and a subwoofer, you’d need seven power outlets and seven Audio Cu devices — one transmitter for your TV (the company says an AV receiver isn’t needed) and one receiver for each speaker. Fasetto says the added latency of the system (signals are specially encoded before being sent through power lines) is less than 20 milliseconds, and it’s not affected by interference.Any speaker with red and black (positive and negative) terminals is compatible with Audio Cu, and up to 10 channels can be sent through power lines from a single transmitter, accommodating a 7.1.2 Dolby Atmos setup. For larger homes, up to six transmitters in separate setups can be used, but the Audio Cu system maxes out at a total of 32 channels. Setup and configuration, including audio presets, EQ adjustments, and effects for individual speakers, all take place within an iOS and Android mobile app, although a TV or projector remote can be used to simply control volume.Fasetto, which has created a couple of other multi-device connectivity solutions, hasn’t announced the price of the Audio Cu transmitters and receivers, but it expects the system to be available soon, when pricing will be revealed. Assuming it doesn’t add too much to the cost of a home theater setup, it could be a welcome alternative solution — also assuming you don’t live in a remote cabin lacking electricity.Comments",
        "link": "https://www.theverge.com/2024/10/1/24259598/fasetto-dolby-atmos-audio-cu-speakers-power-lines",
        "image_path": "static/article_images\\2a0d0204-9d47-4fe5-b38b-0b6c66ca964b.jpg"
    },
    {
        "id": "86d5274c-ae29-453f-ab88-404ec5dab6e8",
        "title": "Bose’s new SoundLink Home is one of its best-looking wireless speakers",
        "body": "Bose has announced a new addition to its long-running SoundLink line of wireless speakers. Most of Bose’s speakers have a colorful and durable design that shrugs off sand and water during an afternoon at the beach, but the new $219 SoundLink Home uses materials like anodized aluminum and a fabric speaker cover for a more premium appearance designed to complement the home.Battery life is rated up to nine hours after a four-hour charge through the speaker’s USB-C port, which doubles as an audio input for connecting to sources like laptops with a cable. The SoundLink Home includes support for Bluetooth 5.3 with a wireless range of about 30 feet, and it can be paired with other SoundLink Home speakers for stereo sound. It lacks Wi-Fi, however, which means that, unlike other Bose speakers, there’s no AirPlay support here.The Bose SoundLink Home comes in cool gray or light silver color options. Image: BoseAlthough designed for indoor use, you may want to avoid using the SoundLink Home in the kitchen because it lacks any dust or water resistance. It does include a microphone so you can use it as a speakerphone or to interact with a smart assistant on a connected device.The SoundLink Home is available starting today through Bose’s online store in either a neutral cool gray or light silver colorway.Correction, October 1st: An earlier version of this article said the SoundLink Home can be paired with other Bose wireless speakers for stereo sound, but that feature only works with the Home speaker specifically.Comments",
        "link": "https://www.theverge.com/2024/10/1/24259408/bose-bluetooth-wireless-speaker-soundlink-home",
        "image_path": "static/article_images\\86d5274c-ae29-453f-ab88-404ec5dab6e8.jpg"
    }
]